import React, { FunctionComponent, useEffect } from 'react';
import { Route, Switch, useLocation } from 'react-router-dom';
import { Page } from './components/Page';
import { Placeholder } from './pages/Placeholder';

console.log(`


  ▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄
  █████░▄▄█░████░▄▄█░██░█████
  █████▄▄▀█░▄▄░█░▄▄█░██░█████
  █████▄▄▄█▄██▄█▄▄▄█▄▄█▄▄████
  ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀

        🐚 built by 🐚

▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄
███░▄▄▀███░▄▄▄█░▄▄▀█▀▄▄▀█░██░█▀▄▄▀██
███░▀▀▄███░█▄▀█░▀▀▄█░██░█░██░█░▀▀░██
███▄█▄▄███▄▄▄▄█▄█▄▄██▄▄███▄▄▄█░█████
▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀

                  @ rarible dao


`);

export const Application: FunctionComponent = () => {
  const { pathname } = useLocation();

  // always scroll when nav changes
  useEffect(() => {
    window.scrollTo(0, 0);
  }, [pathname]);

  return (
    <>
      <Page>
        <Switch>
          <Route exact path="/">
            <Placeholder />
          </Route>
        </Switch>
      </Page>
    </>
  );
};
